Revit 2027 API
TransactionGroup.GetName Method
 Returns the transaction group's name. It could be an empty string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetName()
Public Function GetName As String
public:
String^ GetName()
member GetName : unit -> string
Return Value
String
 The transaction group's current name.
See Also
Reference
TransactionGroup Class
Autodesk.Revit.DB Namespace